{
	"itemGroup.pyrite.pyrite_group": "Pyrite Building Blocks",
	"itemGroup.pyrite.wood_group": "Pyrite Wooden Blocks",
	"itemGroup.pyrite.resource_group": "Pyrite Resource Blocks",
	"itemGroup.pyrite.brick_group": "Pyrite Brick Blocks",
	"itemGroup.pyrite.redstone_group": "Pyrite Redstone Blocks",
	"lore.pyrite.amethyst_bricks": "A variant of Amethyst that has been carved into Bricks.",
	"lore.pyrite.amethyst_door": "A variant of Amethyst that has been carved into a Door.",
	"lore.pyrite.amethyst_pillar": "A variant of Amethyst that has been carved into a Pillar.",
	"lore.pyrite.amethyst_trapdoor": "A variant of Amethyst that has been carved into a Trapdoor.",
	"lore.pyrite.black_bricks": "This Brick block has been dyed Black, and can be used as a building block.",
	"lore.pyrite.black_framed_glass": "This Framed Glass block has been dyed Black, and can be used to as a colourful window.",
	"lore.pyrite.black_framed_glass_pane": "This Framed Glass Pane has been dyed Black, and can be used as a colourful window.",
	"lore.pyrite.black_lamp": "This Lamp block has been dyed Black, and can be used to light up your world.",
	"lore.pyrite.black_terracotta_bricks": "This Terracotta Brick block has been dyed Black, and can be used as a building block.",
	"lore.pyrite.black_torch": "This Torch block has been dyed Black, and can be used to light up your world.",
	"lore.pyrite.black_torch_lever": "This Torch block has been dyed Black, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.blue_bricks": "This Brick block has been dyed Blue, and can be used as a building block.",
	"lore.pyrite.blue_framed_glass": "This Framed Glass block has been dyed Blue, and can be used to as a colourful window.",
	"lore.pyrite.blue_framed_glass_pane": "This Framed Glass Pane has been dyed Blue, and can be used as a colourful window.",
	"lore.pyrite.blue_lamp": "This Lamp block has been dyed Blue, and can be used to light up your world.",
	"lore.pyrite.blue_nether_bricks": "A decorative block adding a pop of blue to your Nether Bricks.",
	"lore.pyrite.blue_rose": "This blue flower makes you think of the past.",
	"lore.pyrite.blue_terracotta_bricks": "This Terracotta Brick block has been dyed Blue, and can be used as a building block.",
	"lore.pyrite.blue_torch": "This Torch block has been dyed Blue, and can be used to light up your world.",
	"lore.pyrite.blue_torch_lever": "This Torch block has been dyed Blue, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.brown_bricks": "This Brick block has been dyed Brown, and can be used as a building block.",
	"lore.pyrite.brown_framed_glass": "This Framed Glass block has been dyed Brown, and can be used to as a colourful window.",
	"lore.pyrite.brown_framed_glass_pane": "This Framed Glass Pane has been dyed Brown, and can be used as a colourful window.",
	"lore.pyrite.brown_lamp": "This Lamp block has been dyed Brown, and can be used to light up your world.",
	"lore.pyrite.brown_terracotta_bricks": "This Terracotta Brick block has been dyed Brown, and can be used as a building block.",
	"lore.pyrite.brown_torch": "This Torch block has been dyed Brown, and can be used to light up your world.",
	"lore.pyrite.brown_torch_lever": "This Torch block has been dyed Brown, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.buttercup": "This yellow flower makes you think of the past.",
	"lore.pyrite.charred_nether_bricks": "A decorative block adding a shadowy accent to your Nether Bricks.",
	"lore.pyrite.chiseled_amethyst_block": "A variant of Amethyst that has been Chiseled.",
	"lore.pyrite.chiseled_diamond_block": "A variant of Diamond that has been Chiseled.",
	"lore.pyrite.chiseled_emerald_block": "A variant of Emerald that has been Chiseled.",
	"lore.pyrite.chiseled_gold_block": "A variant of Gold that has been Chiseled.",
	"lore.pyrite.chiseled_iron_block": "A variant of Iron that has been Chiseled.",
	"lore.pyrite.chiseled_lapis_block": "A variant of Lapis that has been Chiseled.",
	"lore.pyrite.chiseled_netherite_block": "A variant of Netherite that has been Chiseled.",
	"lore.pyrite.chiseled_quartz_block": "A variant of Quartz that has been Chiseled.",
	"lore.pyrite.chiseled_redstone_block": "A variant of Redstone that has been Chiseled.",
	"lore.pyrite.cobblestone_bricks": "This brick block is great for both early and late game builds.",
	"lore.pyrite.copper_pillar": "A variant of Copper that has been carved into a Pillar.",
	"lore.pyrite.cut_amethyst": "A variant of Amethyst that has been Cut.",
	"lore.pyrite.cut_diamond": "A variant of Diamond that has been Cut.",
	"lore.pyrite.cut_emerald": "A variant of Emerald that has been Cut.",
	"lore.pyrite.cut_gold": "A variant of Gold that has been Cut.",
	"lore.pyrite.cut_iron": "A variant of Iron that has been Cut.",
	"lore.pyrite.cut_lapis": "A variant of Lapis that has been Cut.",
	"lore.pyrite.cut_netherite": "A variant of Netherite that has been Cut.",
	"lore.pyrite.cut_quartz": "A variant of Quartz that has been Cut.",
	"lore.pyrite.cut_redstone": "A variant of Redstone that has been Cut.",
	"lore.pyrite.cyan_bricks": "This Brick block has been dyed Cyan, and can be used as a building block.",
	"lore.pyrite.cyan_framed_glass": "This Framed Glass block has been dyed Cyan, and can be used to as a colourful window.",
	"lore.pyrite.cyan_framed_glass_pane": "This Framed Glass Pane has been dyed Cyan, and can be used as a colourful window.",
	"lore.pyrite.cyan_lamp": "This Lamp block has been dyed Cyan, and can be used to light up your world.",
	"lore.pyrite.cyan_terracotta_bricks": "This Terracotta Brick block has been dyed Cyan, and can be used as a building block.",
	"lore.pyrite.cyan_torch": "This Torch block has been dyed Cyan, and can be used to light up your world.",
	"lore.pyrite.cyan_torch_lever": "This Torch block has been dyed Cyan, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.diamond_bricks": "A variant of Diamond that has been carved into Bricks.",
	"lore.pyrite.diamond_door": "A variant of Diamond that has been carved into a Door.",
	"lore.pyrite.diamond_pillar": "A variant of Diamond that has been carved into a Pillar.",
	"lore.pyrite.diamond_trapdoor": "A variant of Diamond that has been carved into a Trapdoor.",
	"lore.pyrite.dragon_bricks": "This Brick block has been dyed with Dragon's Breath, and can be used as a building block.",
	"lore.pyrite.dragon_dye": "A green dye made from Dragon's Breath, that gives blocks crafted with it a subtle glow.",
	"lore.pyrite.dragon_framed_glass": "This Framed Glass block has been dyed with Dragon's Breath, and can be used to as a colourful window.",
	"lore.pyrite.dragon_framed_glass_pane": "This Framed Glass Pane has been dyed with Dragon's Breath, and can be used as a colourful window.",
	"lore.pyrite.dragon_lamp": "This Lamp block has been dyed with Dragon's Breath, and can be used to light up your world.",
	"lore.pyrite.dragon_terracotta_bricks": "This Terracotta Brick block has been dyed with Dragon's Breath, and can be used as a building block.",
	"lore.pyrite.dragon_torch": "This Torch block has been dyed with Dragon's Breath, and can be used to light up your world.",
	"lore.pyrite.dragon_torch_lever": "This Torch block has been dyed with Dragon's Breath, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.emerald_bricks": "A variant of Emerald that has been carved into Bricks.",
	"lore.pyrite.emerald_door": "A variant of Emerald that has been carved into a Door.",
	"lore.pyrite.emerald_pillar": "A variant of Emerald that has been carved into a Pillar.",
	"lore.pyrite.emerald_trapdoor": "A variant of Emerald that has been carved into a Trapdoor.",
	"lore.pyrite.exposed_copper_pillar": "A variant of Exposed Copper that has been carved into a Pillar.",
	"lore.pyrite.framed_glass": "This block can be used as a window. It's slightly tougher than Glass.",
	"lore.pyrite.framed_glass_pane": "This block can be used as a window. It's slightly tougher than Glass.",
	"lore.pyrite.glow_bricks": "This Brick block has been dyed with Glow Ink, and can be used as a building block.",
	"lore.pyrite.glow_dye": "A green dye made from Glow Ink, that gives blocks crafted with it a subtle glow.",
	"lore.pyrite.glow_framed_glass": "This Framed Glass block has been dyed with Glow Ink, and can be used to as a colourful window.",
	"lore.pyrite.glow_framed_glass_pane": "This Framed Glass Pane has been dyed with Glow Ink, and can be used as a colourful window.",
	"lore.pyrite.glow_lamp": "This Lamp block has been dyed with Glow Ink, and can be used to light up your world.",
	"lore.pyrite.glow_terracotta_bricks": "This Terracotta Brick block has been dyed with Glow Ink, and can be used as a building block.",
	"lore.pyrite.glow_torch": "This Torch block has been dyed with Glow Ink, and can be used to light up your world.",
	"lore.pyrite.glow_torch_lever": "This Torch block has been dyed with Glow Ink, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.glowing_obsidian": "This block might have once had a purpose, but now just serves as a light source.",
	"lore.pyrite.gold_bricks": "A variant of Gold that has been carved into Bricks.",
	"lore.pyrite.gold_door": "A variant of Gold that has been carved into a Door.",
	"lore.pyrite.gold_pillar": "A variant of Gold that has been carved into a Pillar.",
	"lore.pyrite.gold_trapdoor": "A variant of Gold that has been carved into a Trapdoor.",
	"lore.pyrite.grass_turf": "This block resembles a Grass Block, with the Grass texture on each side.",
	"lore.pyrite.gray_bricks": "This Brick block has been dyed Gray, and can be used as a building block.",
	"lore.pyrite.gray_framed_glass": "This Framed Glass block has been dyed Gray, and can be used to as a colourful window.",
	"lore.pyrite.gray_framed_glass_pane": "This Framed Glass Pane has been dyed Gray, and can be used as a colourful window.",
	"lore.pyrite.gray_lamp": "This Lamp block has been dyed Gray, and can be used to light up your world.",
	"lore.pyrite.gray_terracotta_bricks": "This Terracotta Brick block has been dyed Gray, and can be used as a building block.",
	"lore.pyrite.gray_torch": "This Torch block has been dyed Gray, and can be used to light up your world.",
	"lore.pyrite.gray_torch_lever": "This Torch block has been dyed Gray, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.green_bricks": "This Brick block has been dyed Green, and can be used as a building block.",
	"lore.pyrite.green_framed_glass": "This Framed Glass block has been dyed Green, and can be used to as a colourful window.",
	"lore.pyrite.green_framed_glass_pane": "This Framed Glass Pane has been dyed Green, and can be used as a colourful window.",
	"lore.pyrite.green_lamp": "This Lamp block has been dyed Green, and can be used to light up your world.",
	"lore.pyrite.green_terracotta_bricks": "This Terracotta Brick block has been dyed Green, and can be used as a building block.",
	"lore.pyrite.green_torch": "This Torch block has been dyed Green, and can be used to light up your world.",
	"lore.pyrite.green_torch_lever": "This Torch block has been dyed Green, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.honey_bricks": "This Brick block has been dyed Honey coloured, and can be used as a building block.",
	"lore.pyrite.honey_dye": "A orange dye made from Honeycomb.",
	"lore.pyrite.honey_framed_glass": "This Framed Glass block has been dyed Honey coloured, and can be used to as a colourful window.",
	"lore.pyrite.honey_framed_glass_pane": "This Framed Glass Pane has been dyed Honey coloured, and can be used as a colourful window.",
	"lore.pyrite.honey_lamp": "This Lamp block has been dyed Honey coloured, and can be used to light up your world.",
	"lore.pyrite.honey_terracotta_bricks": "This Terracotta Brick block has been dyed Honey coloured, and can be used as a building block.",
	"lore.pyrite.honey_torch": "This Torch block has been dyed Honey coloured, and can be used to light up your world.",
	"lore.pyrite.honey_torch_lever": "This Torch block has been dyed Honey coloured, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.iron_bricks": "A variant of Iron that has been carved into Bricks.",
	"lore.pyrite.iron_door": "A variant of Iron that has been carved into a Door.",
	"lore.pyrite.iron_pillar": "A variant of Iron that has been carved into a Pillar.",
	"lore.pyrite.iron_trapdoor": "A variant of Iron that has been carved into a Trapdoor.",
	"lore.pyrite.lapis_bricks": "A variant of Lapis that has been carved into Bricks.",
	"lore.pyrite.lapis_door": "A variant of Lapis that has been carved into a Door.",
	"lore.pyrite.lapis_pillar": "A variant of Lapis that has been carved into a Pillar.",
	"lore.pyrite.lapis_trapdoor": "A variant of Lapis that has been carved into a Trapdoor.",
	"lore.pyrite.light_blue_bricks": "This Brick block has been dyed Light Blue, and can be used as a building block.",
	"lore.pyrite.light_blue_framed_glass": "This Framed Glass block has been dyed Light Blue, and can be used to as a colourful window.",
	"lore.pyrite.light_blue_framed_glass_pane": "This Framed Glass Pane has been dyed Light Blue, and can be used as a colourful window.",
	"lore.pyrite.light_blue_lamp": "This Lamp block has been dyed Light Blue, and can be used to light up your world.",
	"lore.pyrite.light_blue_terracotta_bricks": "This Terracotta Brick block has been dyed Light Blue, and can be used as a building block.",
	"lore.pyrite.light_blue_torch": "This Torch block has been dyed Light Blue, and can be used to light up your world.",
	"lore.pyrite.light_blue_torch_lever": "This Torch block has been dyed Light Blue, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.light_gray_bricks": "This Brick block has been dyed Light Gray, and can be used as a building block.",
	"lore.pyrite.light_gray_framed_glass": "This Framed Glass block has been dyed Light Gray, and can be used to as a colourful window.",
	"lore.pyrite.light_gray_framed_glass_pane": "This Framed Glass Pane has been dyed Light Gray, and can be used as a colourful window.",
	"lore.pyrite.light_gray_lamp": "This Lamp block has been dyed Light Gray, and can be used to light up your world.",
	"lore.pyrite.light_gray_terracotta_bricks": "This Terracotta Brick block has been dyed Light Gray, and can be used as a building block.",
	"lore.pyrite.light_gray_torch": "This Torch block has been dyed Light Gray, and can be used to light up your world.",
	"lore.pyrite.light_gray_torch_lever": "This Torch block has been dyed Light Gray, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.lime_bricks": "This Brick block has been dyed Lime, and can be used as a building block.",
	"lore.pyrite.lime_framed_glass": "This Framed Glass block has been dyed Lime, and can be used to as a colourful window.",
	"lore.pyrite.lime_framed_glass_pane": "This Framed Glass Pane has been dyed Lime, and can be used as a colourful window.",
	"lore.pyrite.lime_lamp": "This Lamp block has been dyed Lime, and can be used to light up your world.",
	"lore.pyrite.lime_terracotta_bricks": "This Terracotta Brick block has been dyed Lime, and can be used as a building block.",
	"lore.pyrite.lime_torch": "This Torch block has been dyed Lime, and can be used to light up your world.",
	"lore.pyrite.lime_torch_lever": "This Torch block has been dyed Lime, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.lit_redstone_lamp": "This block resembles a Redstone Lamp, but is permanently powered thanks to the Redstone Torch inside.",
	"lore.pyrite.locked_chest": "This block might have once had a purpose, but now just serves as a light source.",
	"lore.pyrite.magenta_bricks": "This Brick block has been dyed Magenta, and can be used as a building block.",
	"lore.pyrite.magenta_framed_glass": "This Framed Glass block has been dyed Magenta, and can be used to as a colourful window.",
	"lore.pyrite.magenta_framed_glass_pane": "This Framed Glass Pane has been dyed Magenta, and can be used as a colourful window.",
	"lore.pyrite.magenta_lamp": "This Lamp block has been dyed Magenta, and can be used to light up your world.",
	"lore.pyrite.magenta_terracotta_bricks": "This Terracotta Brick block has been dyed Magenta, and can be used as a building block.",
	"lore.pyrite.magenta_torch": "This Torch block has been dyed Magenta, and can be used to light up your world.",
	"lore.pyrite.magenta_torch_lever": "This Torch block has been dyed Magenta, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.mossy_cobblestone_bricks": "This mossy brick block is great for both early and late game builds.",
	"lore.pyrite.mycelium_turf": "This block resembles Mycelium, with the top texture on each side.",
	"lore.pyrite.nether_brick_fence_gate": "This block resembles a Nether Brick Fence, but can be opened like a door!",
	"lore.pyrite.netherite_bricks": "A variant of Netherite that has been carved into Bricks.",
	"lore.pyrite.netherite_door": "A variant of Netherite that has been carved into a Door.",
	"lore.pyrite.netherite_pillar": "A variant of Netherite that has been carved into a Pillar.",
	"lore.pyrite.netherite_trapdoor": "A variant of Netherite that has been carved into a Trapdoor.",
	"lore.pyrite.nostalgia_amethyst_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.nostalgia_bricks": "Just looking at this block's bright texture brings back memories.",
	"lore.pyrite.nostalgia_cobblestone": "Just looking at this block's dramatic cracks brings back memories.",
	"lore.pyrite.nostalgia_copper_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.nostalgia_diamond_block": "Just looking at this block's shiny texture brings back memories.",
	"lore.pyrite.nostalgia_dye": "A green dye made from an Apple that brings out fond memories.",
	"lore.pyrite.nostalgia_emerald_block": "Just looking at this block's chiseled texture brings back memories.",
	"lore.pyrite.nostalgia_exposed_copper_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.nostalgia_framed_glass": "This Framed Glass block looks familiar, and can be used to as a colourful window.",
	"lore.pyrite.nostalgia_framed_glass_pane": "This Framed Glass Pane looks familiar, and can be used as a colourful window.",
	"lore.pyrite.nostalgia_glowing_obsidian": "This block might have once had a purpose, but now just serves as a light source.",
	"lore.pyrite.nostalgia_gold_block": "Just looking at this block's shiny texture brings back memories.",
	"lore.pyrite.nostalgia_grass_block": "Just looking at this block's vibrant texture brings back memories.",
	"lore.pyrite.nostalgia_gravel": "Just looking at this block's messy texture brings back memories.",
	"lore.pyrite.nostalgia_iron_block": "Just looking at this block's shiny texture brings back memories.",
	"lore.pyrite.nostalgia_lamp": "This Lamp block looks familiar, and can be used to light up your world.",
	"lore.pyrite.nostalgia_lapis_block": "Just looking at this block's smooth texture brings back memories.",
	"lore.pyrite.nostalgia_mossy_cobblestone": "Just looking at this block's dramatic cracks brings back memories.",
	"lore.pyrite.nostalgia_netherite_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.nostalgia_netherrack": "Just looking at this block's strange texture brings back memories.",
	"lore.pyrite.nostalgia_oxidized_copper_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.nostalgia_redstone_block": "Just looking at this block's darker texture brings back memories.",
	"lore.pyrite.nostalgia_terracotta_bricks": "This Terracotta Brick block looks familiar, and can be used as a building block.",
	"lore.pyrite.nostalgia_torch": "This Torch block looks familiar, and can be used to light up your world.",
	"lore.pyrite.nostalgia_torch_lever": "This Torch block looks familiar, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.nostalgia_weathered_copper_block": "Just looking at this block's shiny texture makes you wonder what might have been.",
	"lore.pyrite.orange_bricks": "This Brick block has been dyed Orange, and can be used as a building block.",
	"lore.pyrite.orange_framed_glass": "This Framed Glass block has been dyed Orange, and can be used to as a colourful window.",
	"lore.pyrite.orange_framed_glass_pane": "This Framed Glass Pane has been dyed Orange, and can be used as a colourful window.",
	"lore.pyrite.orange_lamp": "This Lamp block has been dyed Orange, and can be used to light up your world.",
	"lore.pyrite.orange_rose": "This orange flower makes you think of the past.",
	"lore.pyrite.orange_terracotta_bricks": "This Terracotta Brick block has been dyed Orange, and can be used as a building block.",
	"lore.pyrite.orange_torch": "This Torch block has been dyed Orange, and can be used to light up your world.",
	"lore.pyrite.orange_torch_lever": "This Torch block has been dyed Orange, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.oxidized_copper_pillar": "A variant of Oxidized Copper that has been carved into a Pillar.",
	"lore.pyrite.paenoia_rose": "This magenta flower makes you think of what might've been.",
	"lore.pyrite.path_turf": "This block resembles a Dirt Path Block, with the top texture on each side.",
	"lore.pyrite.pink_bricks": "This Brick block has been dyed Pink, and can be used as a building block.",
	"lore.pyrite.pink_daisy": "This pink flower makes you think of the past.",
	"lore.pyrite.pink_framed_glass": "This Framed Glass block has been dyed Pink, and can be used to as a colourful window.",
	"lore.pyrite.pink_framed_glass_pane": "This Framed Glass Pane has been dyed Pink, and can be used as a colourful window.",
	"lore.pyrite.pink_lamp": "This Lamp block has been dyed Pink, and can be used to light up your world.",
	"lore.pyrite.pink_rose": "This pink flower makes you think of the past.",
	"lore.pyrite.pink_terracotta_bricks": "This Terracotta Brick block has been dyed Pink, and can be used as a building block.",
	"lore.pyrite.pink_torch": "This Torch block has been dyed Pink, and can be used to light up your world.",
	"lore.pyrite.pink_torch_lever": "This Torch block has been dyed Pink, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.podzol_turf": "This block resembles Podzol, with the top texture on each side.",
	"lore.pyrite.poisonous_bricks": "This Brick block has been dyed Poisonous Green, and can be used as a building block.",
	"lore.pyrite.poisonous_dye": "A lime dye made from an Poisonous Potato.",
	"lore.pyrite.poisonous_framed_glass": "This Framed Glass block has been dyed Poisonous Green, and can be used to as a colourful window.",
	"lore.pyrite.poisonous_framed_glass_pane": "This Framed Glass Pane has been dyed Poisonous Green, and can be used as a colourful window.",
	"lore.pyrite.poisonous_lamp": "This Lamp block has been dyed Poisonous Green, and can be used to light up your world.",
	"lore.pyrite.poisonous_terracotta_bricks": "This Terracotta Brick block has been dyed Poisonous Green, and can be used as a building block.",
	"lore.pyrite.poisonous_torch": "This Torch block has been dyed Poisonous Green, and can be used to light up your world.",
	"lore.pyrite.poisonous_torch_lever": "This Torch block has been dyed Poisonous Green, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.purple_bricks": "This Brick block has been dyed Purple, and can be used as a building block.",
	"lore.pyrite.purple_framed_glass": "This Framed Glass block has been dyed Purple, and can be used to as a colourful window.",
	"lore.pyrite.purple_framed_glass_pane": "This Framed Glass Pane has been dyed Purple, and can be used as a colourful window.",
	"lore.pyrite.purple_lamp": "This Lamp block has been dyed Purple, and can be used to light up your world.",
	"lore.pyrite.purple_terracotta_bricks": "This Terracotta Brick block has been dyed Purple, and can be used as a building block.",
	"lore.pyrite.purple_torch": "This Torch block has been dyed Purple, and can be used to light up your world.",
	"lore.pyrite.purple_torch_lever": "This Torch block has been dyed Purple, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.quartz_bricks": "A variant of Quartz that has been carved into Bricks.",
	"lore.pyrite.quartz_door": "A variant of Quartz that has been carved into a Door.",
	"lore.pyrite.quartz_pillar": "A variant of Quartz that has been carved into a Pillar.",
	"lore.pyrite.quartz_trapdoor": "A variant of Quartz that has been carved into a Trapdoor.",
	"lore.pyrite.red_bricks": "This Brick block has been dyed Red, and can be used as a building block.",
	"lore.pyrite.red_framed_glass": "This Framed Glass block has been dyed Red, and can be used to as a colourful window.",
	"lore.pyrite.red_framed_glass_pane": "This Framed Glass Pane has been dyed Red, and can be used as a colourful window.",
	"lore.pyrite.red_lamp": "This Lamp block has been dyed Red, and can be used to light up your world.",
	"lore.pyrite.red_terracotta_bricks": "This Terracotta Brick block has been dyed Red, and can be used as a building block.",
	"lore.pyrite.red_torch": "This Torch block has been dyed Red, and can be used to light up your world.",
	"lore.pyrite.red_torch_lever": "This Torch block has been dyed Red, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.redstone_bricks": "A variant of Redstone that has been carved into Bricks.",
	"lore.pyrite.redstone_door": "A variant of Redstone that has been carved into a Door.",
	"lore.pyrite.redstone_pillar": "A variant of Redstone that has been carved into a Pillar.",
	"lore.pyrite.redstone_torch_lever": "This Redstone Torch can be used to hide Redstone in plain sight.",
	"lore.pyrite.redstone_trapdoor": "A variant of Redstone that has been carved into a Trapdoor.",
	"lore.pyrite.rose": "This red flower makes you think of the past.",
	"lore.pyrite.rose_bricks": "This Brick block has been dyed Rose, and can be used as a building block.",
	"lore.pyrite.rose_dye": "A red dye made from mixing Red and Pink Dye.",
	"lore.pyrite.rose_framed_glass": "This Framed Glass block has been dyed Rose, and can be used to as a colourful window.",
	"lore.pyrite.rose_framed_glass_pane": "This Framed Glass Pane has been dyed Rose, and can be used as a colourful window.",
	"lore.pyrite.rose_lamp": "This Lamp block has been dyed Rose, and can be used to light up your world.",
	"lore.pyrite.rose_terracotta_bricks": "This Terracotta Brick block has been dyed Rose, and can be used as a building block.",
	"lore.pyrite.rose_torch": "This Torch block has been dyed Rose, and can be used to light up your world.",
	"lore.pyrite.rose_torch_lever": "This Torch block has been dyed Rose, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.smooth_amethyst": "A variant of Amethyst that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_copper": "A variant of Copper that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_diamond": "A variant of Diamond that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_emerald": "A variant of Emerald that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_exposed_copper": "A variant of Exposed Copper that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_gold": "A variant of Gold that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_iron": "A variant of Iron that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_lapis": "A variant of Lapis that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_netherite": "A variant of Netherite that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_oxidized_copper": "A variant of Oxidized Copper that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_quartz": "A variant of Quartz that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_redstone": "A variant of Redstone that has been carved to be perfectly smooth.",
	"lore.pyrite.smooth_stone_bricks": "A variant of Smooth Stone that has been carved into bricks. ",
	"lore.pyrite.smooth_weathered_copper": "A variant of Weathered Copper that has been carved to be perfectly smooth.",
	"lore.pyrite.soul_torch_lever": "This Soul Torch can be used to hide Redstone in plain sight.",
	"lore.pyrite.star_bricks": "This Brick block has been dyed with a Nether Star, and can be used as a building block.",
	"lore.pyrite.star_dye": "A dark dye made from a Nether Star, that gives blocks crafted with it a bright glow.",
	"lore.pyrite.star_framed_glass": "This Framed Glass block has been dyed with a Nether Star, and can be used to as a colourful window.",
	"lore.pyrite.star_framed_glass_pane": "This Framed Glass Pane has been dyed with a Nether Star, and can be used as a colourful window.",
	"lore.pyrite.star_lamp": "This Lamp block has been dyed with a Nether Star, and can be used to light up your world.",
	"lore.pyrite.star_terracotta_bricks": "This Terracotta Brick block has been dyed with a Nether Star, and can be used as a building block.",
	"lore.pyrite.star_torch": "This Torch block has been dyed with a Nether Star, and can be used to light up your world.",
	"lore.pyrite.star_torch_lever": "This Torch block has been dyed with a Nether Star, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.torch_lever": "This Torch can be used to hide Redstone in plain sight.",
	"lore.pyrite.weathered_copper_pillar": "A variant of Weathered Copper that has been carved into a Pillar.",
	"lore.pyrite.white_bricks": "This Brick block has been dyed White, and can be used as a building block.",
	"lore.pyrite.white_framed_glass": "This Framed Glass block has been dyed White, and can be used to as a colourful window.",
	"lore.pyrite.white_framed_glass_pane": "This Framed Glass Pane has been dyed White, and can be used as a colourful window.",
	"lore.pyrite.white_lamp": "This Lamp block has been dyed White, and can be used to light up your world.",
	"lore.pyrite.white_rose": "This white flower makes you think of the past.",
	"lore.pyrite.white_terracotta_bricks": "This Terracotta Brick block has been dyed White, and can be used as a building block.",
	"lore.pyrite.white_torch": "This Torch block has been dyed White, and can be used to light up your world.",
	"lore.pyrite.white_torch_lever": "This Torch block has been dyed White, and can be used to hide Redstone in plain sight.",
	"lore.pyrite.yellow_bricks": "This Brick block has been dyed Yellow, and can be used as a building block.",
	"lore.pyrite.yellow_framed_glass": "This Framed Glass block has been dyed Yellow, and can be used to as a colourful window.",
	"lore.pyrite.yellow_framed_glass_pane": "This Framed Glass Pane has been dyed Yellow, and can be used as a colourful window.",
	"lore.pyrite.yellow_lamp": "This Lamp block has been dyed Yellow, and can be used to light up your world.",
	"lore.pyrite.yellow_terracotta_bricks": "This Terracotta Brick block has been dyed Yellow, and can be used as a building block.",
	"lore.pyrite.yellow_torch": "This Torch block has been dyed Yellow, and can be used to light up your world.",
	"lore.pyrite.yellow_torch_lever": "This Torch block has been dyed Yellow, and can be used to hide Redstone in plain sight.",
	"tag.item.pyrite.copper_doors": "Copper Doors",
	"tag.item.pyrite.crafting_tables": "Crafting Tables",
	"tag.item.pyrite.metal_doors": "Metal Doors",
	"tag.item.pyrite.mushroom_stem": "Mushroom Stems",
	"tag.pyrite.brick_wall_gates.description": "This block resembles a Wall, but it can be opened like a door.",
	"tag.pyrite.crafting_tables.description": "This block allows you to craft a more varied selection of items than the normal crafting.",
	"tag.pyrite.ladders.description": "This block can be used to climb vertically.",
	"tag.pyrite.metal_bars.description": "This block can be used as a barrier, but can be jumped over.",
	"tag.pyrite.turf_carpets.description": "These decorative blocks look like Turf, and can be placed to hide lights.",
	"tag.pyrite.wall_gates.description": "This block resembles a Wall, but it can be opened like a door."
}